CSI API ETABS v1
cConstraint.SetDiaphragm Method
 DEPRECATED. Defines a Diaphragm constraint.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDiaphragm(
	string Name,
	eConstraintAxis Axis = eConstraintAxis.AutoAxis,
	string CSys = "Global"
)
Function SetDiaphragm (
	Name As String,
	Optional Axis As eConstraintAxis = eConstraintAxis.AutoAxis,
	Optional CSys As String = "Global"
) As Integer
Dim instance As cConstraint
Dim Name As String
Dim Axis As eConstraintAxis
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.SetDiaphragm(Name,
	Axis, CSys)
int SetDiaphragm(
	String^ Name,
	eConstraintAxis Axis = eConstraintAxis::AutoAxis,
	String^ CSys = L"Global"
)
abstract SetDiaphragm :
        Name : string *
        ?Axis : eConstraintAxis *
        ?CSys : string
(* Defaults:
        let _Axis = defaultArg Axis eConstraintAxis.AutoAxis
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
 The name of a constraint.
Axis (Optional)
Type: ETABSv1.eConstraintAxis
CSys (Optional)
Type: System.String
 The name of the coordinate system in which the constraint is defined.
Return Value
Type: Int32
 Returns zero if the constraint data is successfully added or modified, otherwise it returns a nonzero value.
Remarks
 This function is DEPRECATED. Please refer to cDiaphragm.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'define a new constraint
       ret = SapModel.ConstraintDef.SetDiaphragm("Diaph1")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cConstraint Interface
ETABSv1 Namespace